JavaScript/React/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-30 Mon 21:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jacek" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org34d06b1">1. React</a>
<ul>
<li><a href="#orgb16e81d">1.1. Good overview</a>
<ul>
<li><a href="#org61a91bf">1.1.1. warnings</a></li>
</ul>
</li>
<li><a href="#org69ca76b">1.2. create-react-app</a></li>
<li><a href="#org22660d9">1.3. Elements</a>
<ul>
<li><a href="#org583d661">1.3.1. jsx</a></li>
<li><a href="#orgf565317">1.3.2. minimal HTML template</a></li>
<li><a href="#orgd006302">1.3.3. Try React</a></li>
</ul>
</li>
<li><a href="#org799b2ab">1.4. Tutorials</a>
<ul>
<li><a href="#orga345b09">1.4.1. React Fundamentals</a></li>
<li><a href="#org147b953">1.4.2. YouTube</a></li>
<li><a href="#orgccb13ca">1.4.3. React Bits</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org34d06b1" class="outline-2">
<h2 id="org34d06b1"><span class="section-number-2">1</span> React</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb16e81d" class="outline-3">
<h3 id="orgb16e81d"><span class="section-number-3">1.1</span> Good overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://www.lullabot.com/articles/how-to-learn-react">https://www.lullabot.com/articles/how-to-learn-react</a>
</p>
</div>
<div id="outline-container-org61a91bf" class="outline-4">
<h4 id="org61a91bf"><span class="section-number-4">1.1.1</span> warnings</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Points to paid for tutorials
</p>
</div>
</div>
</div>


<div id="outline-container-org69ca76b" class="outline-3">
<h3 id="org69ca76b"><span class="section-number-3">1.2</span> create-react-app</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://github.com/facebook/create-react-app">https://github.com/facebook/create-react-app</a>
</p>

<pre class="example">
npx create-react-app my-app
cd my-app
npm start
</pre>
</div>
</div>

<div id="outline-container-org22660d9" class="outline-3">
<h3 id="org22660d9"><span class="section-number-3">1.3</span> Elements</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org583d661" class="outline-4">
<h4 id="org583d661"><span class="section-number-4">1.3.1</span> jsx</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
<a href="https://reactjs.org/docs/introducing-jsx.html">https://reactjs.org/docs/introducing-jsx.html</a>
</p>
</div>
</div>

<div id="outline-container-orgf565317" class="outline-4">
<h4 id="orgf565317"><span class="section-number-4">1.3.2</span> minimal HTML template</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
<a href="https://raw.githubusercontent.com/reactjs/reactjs.org/master/static/html/single-file-example.html">https://raw.githubusercontent.com/reactjs/reactjs.org/master/static/html/single-file-example.html</a>
</p>
</div>
</div>

<div id="outline-container-orgd006302" class="outline-4">
<h4 id="orgd006302"><span class="section-number-4">1.3.3</span> Try React</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
<a href="https://reactjs.org/docs/try-react.html">https://reactjs.org/docs/try-react.html</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org799b2ab" class="outline-3">
<h3 id="org799b2ab"><span class="section-number-3">1.4</span> Tutorials</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orga345b09" class="outline-4">
<h4 id="orga345b09"><span class="section-number-4">1.4.1</span> React Fundamentals</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
<a href="https://egghead.io/courses/start-learning-react">https://egghead.io/courses/start-learning-react</a>
</p>
</div>
</div>

<div id="outline-container-org147b953" class="outline-4">
<h4 id="org147b953"><span class="section-number-4">1.4.2</span> YouTube</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
<a href="https://www.youtube.com/playlist?list=PLoYCgNOIyGABj2GQSlDRjgvXtqfDxKm5b">https://www.youtube.com/playlist?list=PLoYCgNOIyGABj2GQSlDRjgvXtqfDxKm5b</a>
</p>
</div>
</div>

<div id="outline-container-orgccb13ca" class="outline-4">
<h4 id="orgccb13ca"><span class="section-number-4">1.4.3</span> React Bits</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
<a href="https://vasanthk.gitbooks.io/react-bits/">https://vasanthk.gitbooks.io/react-bits/</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jacek</p>
<p class="date">Created: 2018-04-30 Mon 21:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
